vlm/base/InformationRegisters/ЦеныНоменклатуры25.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры25</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>МаркетинговоеМероприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаркетинговыеМероприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Формула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаЦО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатурыДляЦенообразования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияЦО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатурыДляЦенообразования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УпаковкаЦО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

vlm/base/Enums/ВариантОтбораДляКлючаЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантОтбораДляКлючаЦен</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеИспользовать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Использовать</Name>
					<Comment>По вхождению самого объекта (Номенклатуры / Характеристики и пр.)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИспользоватьПоРеквизитам</Name>
					<Comment>По вхождению реквизитов объекта (включая доп. реквизиты)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

vlm/base/Catalogs/СерииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СерииНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГоденДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерСерии</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКиЗГИСМ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерКиЗГИСМ</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RFIDTID</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.RFIDTID</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RFIDUser</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RFIDEPC</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.RFIDEPC</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EPCGTIN</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RFIDМеткаНеЧитаемая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводительЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Справка2ЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводительВЕТИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредприятияВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаписьСкладскогоЖурналаВЕТИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗаписиСкладскогоЖурналаВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПартииВЕТИС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаВЕТИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяРозничнаяЦенаМОТП</Name>
					<Comment>Максимальная розничная цена (МОТП)</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерияНоменклатурыДляЦенообразования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатурыДляЦенообразования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_НомерЗавеса</Name>
					<Comment>// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_НомерЗаказа</Name>
					<Comment>// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_Брутто</Name>
					<Comment>// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_ТипТары</Name>
					<Comment>// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_Штрихкод</Name>
					<Comment>// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_НормативнаяМасса</Name>
					<Comment>ЛТ5.30</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_Эмалировщик</Name>
					<Comment>ЛТ5.30</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_Завешено</Name>
					<Comment>ЛТ5.26</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_МассаНетто</Name>
					<Comment>ЛТ5.26</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_Весовщик</Name>
					<Comment>ЛТ5.26</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_СменаВесовщика</Name>
					<Comment>ЛТ5.26</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СменыВесовщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_ДатаВремяЗавеса</Name>
					<Comment>ЛТ5.26</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_Контроллёр</Name>
					<Comment>ЛТ5.26</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_ВидРабочегоЦентра</Name>
					<Comment>ЛТ_БН</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРабочихЦентров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_Смена</Name>
					<Comment>ЛТ_БН</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_Перемаркировка</Name>
					<Comment>ЛТ_БН</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

vlm/base/Catalogs/СерииНоменклатурыДляЦенообразования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СерииНоменклатурыДляЦенообразования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГоденДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКиЗГИСМ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерКиЗГИСМ</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводительЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Справка2ЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводительВЕТИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредприятияВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаписьСкладскогоЖурналаВЕТИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗаписиСкладскогоЖурналаВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПартииВЕТИС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаВЕТИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяРозничнаяЦенаМОТП</Name>
					<Comment>Максимальная розничная цена (МОТП)</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоРеквизитов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизитыЦенообразования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

vlm/base/CommonModules/ЦенообразованиеКлиентСервер/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Модуль содержит процедуры и функции для обработки действий пользователя
// в процессе работы с ценами.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Рассчитывает сумму НДС от суммы в зависимости от включения НДС в цену.
//
// Параметры:
//  Сумма           - Число - Сумма, от которой необходимо рассчитать сумму НДС.
//  СтавкаНДС       - СправочникСсылка.СтавкиНДС - Ставка НДС.
//  ЦенаВключаетНДС - Булево - Признак включения НДС в цену.
//  НалогообложениеНДС - ПеречислениеСсылка.ТипыНалогообложенияНДС - налогообложение документа
//
// Возвращаемое значение:
//  Число - Сумма НДС.
//
Функция РассчитатьСуммуНДС(Сумма, СтавкаНДС, ЦенаВключаетНДС = Истина, НалогообложениеНДС = Неопределено) Экспорт
	
	Возврат УчетНДСУПКлиентСервер.РассчитатьСуммуНДС(
		Сумма,
		УчетНДСУПКлиентСервер.ЗначениеСтавкиНДС(СтавкаНДС),
		ЦенаВключаетНДС,
		НалогообложениеНДС)
	
КонецФункции // РассчитатьСуммуНДС()

// Возвращает числовое значение ставки НДС
//
// Параметры:
//  СтавкаНДС - СправочникСсылка.СтавкиНДС - значение СтавкиНДС.
//
// Возвращаемое значение:
//  Число - Значение ставки НДС числом.
//
Функция ПолучитьСтавкуНДСЧислом(Знач СтавкаНДС) Экспорт
	
	Возврат УчетНДСУПКлиентСервер.ЗначениеСтавкиНДС(СтавкаНДС);
	
КонецФункции // ПолучитьСтавкуНДСЧислом()

#Область ПроцедурыИФункцииРаботыСИтогамиДокументов

// Возвращает сумму документа с учетом НДС
//
// Параметры:
//  Товары          - ТабличнаяЧасть - табличная часть документа для подсчета суммы документа.
//  ЦенаВключаетНДС - Булево - признак включения НДС в цену документа.
//
// Возвращаемое значение:
//  Число - Сумма документа с учетом НДС/.
//
Функция ПолучитьСуммуДокумента(Товары, Знач ЦенаВключаетНДС) Экспорт

	СуммаДокумента = Товары.Итог("Сумма");

	Если Не ЦенаВключаетНДС Тогда
		СуммаДокумента = СуммаДокумента + Товары.Итог("СуммаНДС");
	КонецЕсли;

	Возврат СуммаДокумента;

КонецФункции // ПолучитьСуммуДокумента()

#КонецОбласти

#Область ПроцедурыИФункцииДляВыполненияОкругления

// Округляет число по заданному порядку 
//
// Параметры:
//  Число              - Число - исходное число.
//  ТочностьОкругления - Число - Число, определяет точность округления.
//  ВариантОкругления  - ПеречислениеСсылка.ВариантыОкругления - определяет способ округления.
//
// Возвращаемое значение:
//  Число - исходное число, округленное с заданной точностью.
//
Функция ОкруглитьЦену(Число, ТочностьОкругления, ВариантОкругления) Экспорт

	Перем Результат;
		
	// вычислим количество интервалов, входящих в число
	Если ТочностьОкругления <> 0 Тогда
		КоличествоИнтервалов = Число / ТочностьОкругления;
	Иначе
		КоличествоИнтервалов = 0;
	КонецЕсли;
	
	// вычислим целое количество интервалов.
	КоличествоЦелыхИнтервалов = Цел(КоличествоИнтервалов);
		
	Если КоличествоИнтервалов = КоличествоЦелыхИнтервалов Тогда
		// Числа поделились нацело. Округлять не нужно.
		Результат = Число;
	Иначе
		Если ВариантОкругления = ПредопределенноеЗначение("Перечисление.ВариантыОкругления.ВсегдаВПользуПредприятия") Тогда
			// При порядке округления "0.05" 0.371 должно округлится до 0.4
			Результат = ТочностьОкругления * (КоличествоЦелыхИнтервалов + 1);
		ИначеЕсли ВариантОкругления = ПредопределенноеЗначение("Перечисление.ВариантыОкругления.ВсегдаВПользуКлиента") Тогда
			// При порядке округления "0.05" 0.371 должно округлится до 0.35
			Результат = ТочностьОкругления * (КоличествоЦелыхИнтервалов);
		Иначе
			// При порядке округления "0.05" 0.371 должно округлится до 0.35,
			// а 0.376 до 0.4.
			Результат = ТочностьОкругления * Окр(КоличествоИнтервалов, 0, РежимОкругления.Окр15как20);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ОкруглитьЦену()

// Применяет "психологическое округление" к числу
//
// Параметры:
//  Число                     - Число - число, к которому применяется округление.
//  ПсихологическоеОкругление - Число - число, значение "психологического округления".
//
// Возвращаемое значение:
//  Число - Результат применения "психологического округления" к числу.
//
Функция ПрименитьПсихологическоеОкругление(Число, ПсихологическоеОкругление) Экспорт
	
	Если Число = 0 ИЛИ ПсихологическоеОкругление = 0 Тогда
		Возврат Число;
	Иначе
		РезультатОкругления = Число - ПсихологическоеОкругление;
		Возврат ?(РезультатОкругления < Число, РезультатОкругления, Число);
	КонецЕсли;
	
КонецФункции // ПрименитьПсихологическоеОкругление()

#КонецОбласти

#Область ПроцедурыИФункцииПодменыТекстовЗапросов

// Текст запроса регистр сведений цены номенклатуры.
// 
// Параметры:
//  ИсточникТоваров - Строка - название таблицы с товарами
//  ПараметрДата - Строка - название параметра Дата
//  УсловиеВидЦены - Неопределено, Структура - условие по виду цен
//  ИспользуетсяЦенообразование25 - Неопределено, Булево - Используется ценообразование 2.5
// 
// Возвращаемое значение:
//  Строка - Текст запроса регистр сведений цены номенклатуры
Функция ТекстЗапросаРегистрСведенийЦеныНоменклатуры(ИсточникТоваров,
													ПараметрДата = "&Дата", 
													УсловиеВидЦены = Неопределено,
													ИспользуетсяЦенообразование25 = Неопределено) Экспорт
	
	Если ИспользуетсяЦенообразование25 = Неопределено Тогда
		ИспользуетсяЦенообразование25 = ЦенообразованиеВызовСервера.ИспользуетсяЦенообразование25();
	КонецЕсли;
	
	Если ИспользуетсяЦенообразование25 Тогда
		ТекстЗапроса = 
		"РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(КОНЕЦПЕРИОДА(&ПараметрДата, ДЕНЬ),
		|				&УсловиеВидЦены1 И
		|				(&УсловиеВидЦены2, Номенклатура,ХарактеристикаЦО,СерияЦО,УпаковкаЦО) В (
		|					ВЫБРАТЬ
		|						&УсловиеВидЦены3,
		|						Товары.Номенклатура,
		|						Товары.ХарактеристикаЦО,
		|						Товары.СерияЦО,
		|						Товары.УпаковкаЦО
		|					ИЗ
		|						&ИсточникТоваров КАК Товары
		|					)
		|			)";
	Иначе
		ТекстЗапроса = 
		"РегистрСведений.ЦеныНоменклатуры.СрезПоследних(КОНЕЦПЕРИОДА(&ПараметрДата, ДЕНЬ),
		|				&УсловиеВидЦены1 И
		|				(&УсловиеВидЦены2, Номенклатура,Характеристика) В (
		|					ВЫБРАТЬ
		|						&УсловиеВидЦены3,
		|						Товары.Номенклатура,
		|						Товары.Характеристика
		|					ИЗ
		|						&ИсточникТоваров КАК Товары
		|					)
		|			)";
	КонецЕсли;

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИсточникТоваров", ИсточникТоваров);
	
	ТекстЗаменыУсловиеВидЦены1 = "ИСТИНА";
	ТекстЗаменыУсловиеВидЦены2 = "";
	ТекстЗаменыУсловиеВидЦены3 = "";
	
	Если ТипЗнч(УсловиеВидЦены) = Тип("Структура") Тогда
		Если УсловиеВидЦены.Свойство("Константа") Тогда
			ТекстЗаменыУсловиеВидЦены1 = 
				"ВидЦены В (
				|	ВЫБРАТЬ
				|		&ИмяКонстанты КАК ВидЦены
				|	ИЗ
				|		Константы КАК Константы)";
				
			ТекстЗаменыУсловиеВидЦены1 = СтрЗаменить(ТекстЗаменыУсловиеВидЦены1, "&ИмяКонстанты", "Константы." + УсловиеВидЦены.Константа);
		ИначеЕсли УсловиеВидЦены.Свойство("Параметр") Тогда
			ТекстЗаменыУсловиеВидЦены1 = 
				"ВидЦены = &ИмяПараметра";
			ТекстЗаменыУсловиеВидЦены1 = СтрЗаменить(ТекстЗаменыУсловиеВидЦены1, "&ИмяПараметра", УсловиеВидЦены.Параметр);
		ИначеЕсли УсловиеВидЦены.Свойство("ВТаблице") Тогда 
			ТекстЗаменыУсловиеВидЦены2 = "ВидЦены,";
			Если СтрНайти(УсловиеВидЦены.ВТаблице, "&") = 0 Тогда
				ТекстЗаменыУсловиеВидЦены3 = "Товары.";
			КонецЕсли;
			ТекстЗаменыУсловиеВидЦены3 = ТекстЗаменыУсловиеВидЦены3 + УсловиеВидЦены.ВТаблице + ",";
		КонецЕсли;
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеВидЦены1", ТекстЗаменыУсловиеВидЦены1);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеВидЦены2,", ТекстЗаменыУсловиеВидЦены2);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеВидЦены3,", ТекстЗаменыУсловиеВидЦены3);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПараметрДата", ПараметрДата);
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Текст запроса регистр сведений цены номенклатуры условие соединения.
// 
// Параметры:
//  ИсточникТоваров - Строка - название таблицы с товарами
//  ИсточникЦен - Строка - название таблицы с ценами
//  ИсточникВидовЦен - Строка, Неопределено - значение, если необходимо в соединение соединять по виду цен
//  ИспользуетсяЦенообразование25 - Неопределено, Булево - Используется ценообразование 2.5
// 
// Возвращаемое значение:
//  Строка - Текст запроса регистр сведений цены номенклатуры условие соединения
Функция ТекстЗапросаРегистрСведенийЦеныНоменклатурыУсловиеСоединения(ИсточникТоваров,
																	ИсточникЦен,
																	ИсточникВидовЦен = Неопределено,
																	ИспользуетсяЦенообразование25 = Неопределено) Экспорт
	
	Если ИспользуетсяЦенообразование25 = Неопределено Тогда
		ИспользуетсяЦенообразование25 = ЦенообразованиеВызовСервера.ИспользуетсяЦенообразование25();
	КонецЕсли;
	
	ТекстыЗапросов = Новый Массив();
	Если ИспользуетсяЦенообразование25 Тогда
		ТекстЗапроса = "
		|			&ИсточникТоваров.Номенклатура = &ИсточникЦен.Номенклатура
		|			И &ИсточникТоваров.ХарактеристикаЦО = &ИсточникЦен.ХарактеристикаЦО
		|			И &ИсточникТоваров.СерияЦО = &ИсточникЦен.СерияЦО
		|			И &ИсточникТоваров.УпаковкаЦО = &ИсточникЦен.УпаковкаЦО";
	Иначе
		ТекстЗапроса = "
		|			&ИсточникТоваров.Номенклатура = &ИсточникЦен.Номенклатура
		|			И &ИсточникТоваров.Характеристика = &ИсточникЦен.Характеристика";
	КонецЕсли;
	ТекстыЗапросов.Добавить(ТекстЗапроса);

	Если ИсточникВидовЦен <> Неопределено Тогда
		ТекстыЗапросов.Добавить(Символы.ПС + "		И ");
		ТекстыЗапросов.Добавить(ИсточникВидовЦен);
		ТекстыЗапросов.Добавить(" = &ИсточникЦен.ВидЦены");
	КонецЕсли;
		
	ТекстЗапроса = СтрСоединить(ТекстыЗапросов);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИсточникТоваров", ИсточникТоваров);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИсточникЦен", ИсточникЦен);
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Текст запроса временной таблицы с дополнением для ценообразования.
// 
// Параметры:
//  Настройки - см. НастройкиДляВременнойТаблицыСДополнениемДляЦенообразования
//  ИспользуетсяЦенообразование25 - Неопределено - Используется ценообразование 2.5
// 
// Возвращаемое значение:
//  Строка - Текст запроса временной таблицы с дополнением для ценообразования
Функция ТекстЗапросаВременнойТаблицыСДополнениемДляЦенообразования(Настройки,
																	ИспользуетсяЦенообразование25 = Неопределено) Экспорт
	
	Если ИспользуетсяЦенообразование25 = Неопределено Тогда
		ИспользуетсяЦенообразование25 = ЦенообразованиеВызовСервера.ИспользуетсяЦенообразование25();
	КонецЕсли;
	
	ТекстЗапроса = "
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ПоляТаблицыТоваров
	|ПОМЕСТИТЬ 
	|	#ПриемникТоваров
	|ИЗ
	|	#ИсточникТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|		ПО ВидыНоменклатуры.Ссылка = &ИсточникВидаНоменклатуры
	|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ИсточникТоваров", Настройки.ИсточникТоваров);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ПриемникТоваров", Настройки.ПриемникТоваров);

	ПоляЗапроса = Новый Массив();
	ПоляЗапроса.Добавить(Настройки.ИсточникТоваров + "." + Настройки.ПолеНоменклатура);
	
	Если ЗначениеЗаполнено(Настройки.ПолеХарактеристика) Тогда
		ПоляЗапроса.Добавить(Настройки.ИсточникТоваров + "." + Настройки.ПолеХарактеристика);
	КонецЕсли;
	Если ЗначениеЗаполнено(Настройки.ПолеСерия) Тогда
		ПоляЗапроса.Добавить(Настройки.ИсточникТоваров + "." + Настройки.ПолеСерия);
	КонецЕсли;
	Если ЗначениеЗаполнено(Настройки.ПолеУпаковка) Тогда
		ПоляЗапроса.Добавить(Настройки.ИсточникТоваров + "." + Настройки.ПолеУпаковка);
	КонецЕсли;

	ПоляЗапроса.Добавить(ТекстПолейДляЦенообразования(Настройки,,ИспользуетсяЦенообразование25));
	
	Если ЗначениеЗаполнено(Настройки.СписокПрочихПолей) Тогда
		СписокПрочихПолей = СтрРазделить(Настройки.СписокПрочихПолей, ",", Ложь);
		Для Каждого Поле Из СписокПрочихПолей Цикл
			ПоляЗапроса.Добавить(Настройки.ИсточникТоваров + "." + СокрЛП(Поле));
		КонецЦикла;
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляТаблицыТоваров", СтрСоединить(ПоляЗапроса, "," + Символы.ПС));
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИсточникВидаНоменклатуры", Настройки.ИсточникТоваров + "." + Настройки.ПолеНоменклатура + ".ВидНоменклатуры");
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Текст полей для ценообразования.
// 
// Параметры:
//  Настройки - Структура - Настройки:
// * ИсточникТоваров - Строка -
// * ПриемникТоваров - Строка -
// * ПолеНоменклатура - Строка -
// * ПолеХарактеристика - Строка -
// * ПолеСерия - Строка -
// * ПолеУпаковка - Строка -
// * СписокПрочихПолей - Строка -
// ДляПолейГруппировки  - Булево - Истина, для полоей группировки, не присваивать синонимы
//  ИспользуетсяЦенообразование25 - Неопределено - Используется ценообразование 2.5
// 
// Возвращаемое значение:
//  Строка - Текст полей для ценообразования
Функция ТекстПолейДляЦенообразования(Настройки, 
										ДляПолейГруппировки = Ложь,
										ИспользуетсяЦенообразование25 = Неопределено) Экспорт
	
	ПоляЗапроса = Новый Массив();

	Если ИспользуетсяЦенообразование25 = Неопределено Тогда
		ИспользуетсяЦенообразование25 = ЦенообразованиеВызовСервера.ИспользуетсяЦенообразование25();
	КонецЕсли;
	
	Если Не ИспользуетсяЦенообразование25 Тогда
		Возврат "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Настройки.ПолеХарактеристика) Тогда
		ТекстПоля =	"ВЫБОР
						|	КОГДА
						|		ВидыНоменклатуры.НастройкиКлючаЦенПоХарактеристике = ЗНАЧЕНИЕ(Перечисление.ВариантОтбораДляКлючаЦен.НеИспользовать)
						|		ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка)
						|	ИНАЧЕ ЕСТЬNULL(" + Настройки.ИсточникТоваров + "." + Настройки.ПолеХарактеристика + ".ХарактеристикаНоменклатурыДляЦенообразования, 
						|			ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка))
						|КОНЕЦ";
	Иначе
		ТекстПоля =	"ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка)";
	КонецЕсли;
	ТекстПоля = ТекстПоля + ?(ДляПолейГруппировки, ""," КАК ХарактеристикаЦО");
	ПоляЗапроса.Добавить(ТекстПоля);
	
	Если ЗначениеЗаполнено(Настройки.ПолеСерия) Тогда
		ТекстПоля =	"ВЫБОР
						|	КОГДА
						|		ВидыНоменклатуры.НастройкиКлючаЦенПоСерии = ЗНАЧЕНИЕ(Перечисление.ВариантОтбораДляКлючаЦен.НеИспользовать)
						|			ИЛИ "+ Настройки.ИсточникТоваров + "." + Настройки.ПолеСерия + " = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
						|		ТОГДА ЗНАЧЕНИЕ(Справочник.СерииНоменклатурыДляЦенообразования.ПустаяСсылка)
						|	ИНАЧЕ ЕСТЬNULL(" + Настройки.ИсточникТоваров + "." + Настройки.ПолеСерия + ".СерияНоменклатурыДляЦенообразования, 
						|			ЗНАЧЕНИЕ(Справочник.СерииНоменклатурыДляЦенообразования.ПустаяСсылка))
						|КОНЕЦ";
	Иначе
		ТекстПоля =	"ЗНАЧЕНИЕ(Справочник.СерииНоменклатурыДляЦенообразования.ПустаяСсылка)";
	КонецЕсли;
	ТекстПоля = ТекстПоля + ?(ДляПолейГруппировки, ""," КАК СерияЦО");
	ПоляЗапроса.Добавить(ТекстПоля);
	
	Если ЗначениеЗаполнено(Настройки.ПолеУпаковка) Тогда
		ТекстПоля =	"ВЫБОР
						|	КОГДА
						|		ВидыНоменклатуры.НастройкиКлючаЦенПоУпаковке = ЗНАЧЕНИЕ(Перечисление.ВариантОтбораДляКлючаЦен.НеИспользовать)
						|		ТОГДА ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
						|	ИНАЧЕ " + Настройки.ИсточникТоваров + "." + Настройки.ПолеУпаковка + "
						|КОНЕЦ";
	Иначе
		ТекстПоля =	"ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)";
	КонецЕсли;
	ТекстПоля = ТекстПоля + ?(ДляПолейГруппировки, ""," КАК УпаковкаЦО");
	
	ПоляЗапроса.Добавить(ТекстПоля);
	
	Возврат СтрСоединить(ПоляЗапроса, "," + Символы.ПС);
	
КонецФункции

// Настройки для временной таблицы с дополнением для ценообразования.
// 
// Возвращаемое значение:
//  Структура - Настройки для временной таблицы с дополнением для ценообразования:
// * ИсточникТоваров - Строка - Наименования таблицы истоника товаров
// * ПриемникТоваров - Строка - Наименования таблицы приемника товаров
// * ПолеНоменклатура - Строка - Наименование поля номенклатуры. Если нет необходимо присвоить путую строку
// * ПолеХарактеристика - Строка - Наименование поля характеристики. Если нет необходимо присвоить путую строку
// * ПолеСерия - Строка - Наименование поля серии. Если нет необходимо присвоить путую строку
// * ПолеУпаковка - Строка - Наименование поля упаковки. Если нет необходимо присвоить путую строку
// * СписокПрочихПолей - Строка - все остальные поля источника товаров через запятую
//
Функция НастройкиДляВременнойТаблицыСДополнениемДляЦенообразования() Экспорт
	
	Настройки = Новый Структура();
	
	Настройки.Вставить("ИсточникТоваров", "");
	Настройки.Вставить("ПриемникТоваров", "");
	Настройки.Вставить("ПолеНоменклатура", "Номенклатура");
	Настройки.Вставить("ПолеХарактеристика", "Характеристика");
	Настройки.Вставить("ПолеСерия", "Серия");
	Настройки.Вставить("ПолеУпаковка", "Упаковка");
	Настройки.Вставить("СписокПрочихПолей", "");
	
	Возврат Настройки;
	
КонецФункции

// Текст запроса регистр сведений цены номенклатуры индексирование.
// 
// Параметры:
//  ИспользуетсяЦенообразование25 - Неопределено, Булево - Используется ценообразование 2.5
// 
// Возвращаемое значение:
//  Строка - Текст запроса регистр сведений цены номенклатуры индексирование
Функция ТекстЗапросаРегистрСведенийЦеныНоменклатурыИндексирование(ИспользуетсяЦенообразование25 = Неопределено) Экспорт

	Если ИспользуетсяЦенообразование25 = Неопределено Тогда
		ИспользуетсяЦенообразование25 = ЦенообразованиеВызовСервера.ИспользуетсяЦенообразование25();
	КонецЕсли;

	Если ИспользуетсяЦенообразование25 Тогда
		ТекстЗамены = "Номенклатура,
			|	ХарактеристикаЦО,
			|	СерияЦО,
			|	УпаковкаЦО,
			|	ВидЦены";
	Иначе
		ТекстЗамены = "Номенклатура,
			|	Характеристика,
			|	ВидЦены";
	КонецЕсли;

	Возврат ТекстЗамены;

КонецФункции

#КонецОбласти

#КонецОбласти
